backend/tests/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    # Phase 1: Warm up (50 users/sec)
    - duration: 30
      arrivalRate: 50
      name: "Warm up"

    # Phase 2: Sustained load (200 users/sec)
    - duration: 60
      arrivalRate: 200
      name: "Sustained load"

    # Phase 3: Spike — 500 users/sec (geo-filtered bids)
    - duration: 30
      arrivalRate: 500
      name: "Spike: geo-filtered bids"

    # Phase 4: Peak — 1000+ concurrent across markets
    - duration: 30
      arrivalRate: 1000
      name: "Peak: 1000 concurrent"
      rampTo: 1500

    # Phase 5: Cool down
    - duration: 15
      arrivalRate: 50
      name: "Cool down"

  plugins:
    expect: {}

  defaults:
    headers:
      Content-Type: "application/json"

  # Custom metrics
  ensure:
    maxErrorRate: 5
    max: 
      p99: 2000  # p99 latency under 2s

scenarios:
  # ─── Health check (5% traffic) ───────────────
  - name: "Health check"
    weight: 5
    flow:
      - get:
          url: "/health"

  # ─── List leads (10% traffic) ────────────────
  - name: "List leads"
    weight: 10
    flow:
      - get:
          url: "/api/v1/leads"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200

  # ─── Place bid — geo-filtered (35% traffic) ──
  - name: "Place bid (geo-filtered)"
    weight: 35
    flow:
      - post:
          url: "/api/v1/bids"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          json:
            leadId: "{{ $randomString() }}"
            amount: "{{ $randomNumber(10, 500) }}"
            geoState: "{{ $randomItem(['FL', 'CA', 'TX', 'NY', 'WA', 'CO', 'IL', 'OH', 'PA', 'GA']) }}"
          expect:
            - statusCode:
                - 201
                - 400
                - 403
                - 404

  # ─── Compliance check (15% traffic) ──────────
  - name: "ACE compliance check"
    weight: 15
    flow:
      - post:
          url: "/api/v1/demo/compliance-check"
          json:
            walletAddress: "0x{{ $randomString(40) }}"
            vertical: "{{ $randomItem(['solar', 'mortgage', 'insurance', 'roofing']) }}"
            geoState: "{{ $randomItem(['FL', 'CA', 'TX', 'NY', 'WA', 'CO']) }}"
          expect:
            - statusCode: 200

  # ─── ZK verify (10% traffic) ─────────────────
  - name: "ZK proof verification"
    weight: 10
    flow:
      - post:
          url: "/api/v1/demo/zk-verify"
          json:
            vertical: "{{ $randomItem(['solar', 'mortgage', 'roofing']) }}"
            geoState: "{{ $randomItem(['FL', 'CA', 'TX', 'NY']) }}"
            geoZip: "{{ $randomNumber(10000, 99999) }}"
            targetStates:
              - FL
              - CA
              - TX
          expect:
            - statusCode: 200

  # ─── List asks / marketplace (15% traffic) ───
  - name: "List asks geo-filtered"
    weight: 15
    flow:
      - get:
          url: "/api/v1/asks?vertical={{ $randomItem(['solar', 'mortgage']) }}&geo={{ $randomItem(['FL', 'CA', 'TX']) }}&limit=20"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200

  # ─── E2E demo flow (5% traffic) ─────────────
  - name: "E2E demo bid flow"
    weight: 5
    flow:
      - post:
          url: "/api/v1/demo/e2e-bid"
          json:
            vertical: "{{ $randomItem(['solar', 'mortgage', 'roofing']) }}"
            geoState: "{{ $randomItem(['FL', 'CA', 'TX']) }}"
            geoZip: "33101"
            reservePrice: "{{ $randomNumber(10, 100) }}"
            bidAmount: "{{ $randomNumber(20, 200) }}"
            buyerAddress: "0x{{ $randomString(40) }}"
          expect:
            - statusCode:
                - 200
                - 400
                - 500

  # ─── Privacy test (5% traffic) ───────────────
  - name: "Privacy encrypt/decrypt"
    weight: 5
    flow:
      - post:
          url: "/api/v1/demo/privacy-test"
          json:
            amount: "{{ $randomNumber(10, 500) }}"
            buyerAddress: "0x{{ $randomString(40) }}"
          expect:
            - statusCode: 200

  # ─── Global geo bid (10% traffic) ─────────────
  - name: "Place bid (global geo)"
    weight: 10
    flow:
      - post:
          url: "/api/v1/bids"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          json:
            leadId: "{{ $randomString() }}"
            amount: "{{ $randomNumber(10, 500) }}"
            geoCountry: "{{ $randomItem(['US', 'CA', 'GB', 'AU', 'DE', 'FR', 'BR', 'IN', 'MX', 'JP', 'KR', 'SG', 'AE', 'ZA', 'NG']) }}"
            geoState: "{{ $randomItem(['CA', 'TX', 'ON', 'ENG', 'NSW', 'NW', 'IDF', 'SP', 'MH', 'TK', 'SEO', 'SG', 'DXB', 'GP', 'LA']) }}"
          expect:
            - statusCode:
                - 201
                - 400
                - 403
                - 404

  # ─── Multi-country marketplace (3% traffic) ───
  - name: "Global marketplace listing"
    weight: 3
    flow:
      - get:
          url: "/api/v1/asks?country={{ $randomItem(['US', 'AU', 'DE', 'GB', 'IN']) }}&vertical={{ $randomItem(['solar', 'mortgage', 'roofing', 'insurance']) }}&limit=20"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200

  # ─── Cross-border ACE compliance (5% traffic) ──
  - name: "Cross-border ACE (EU solar to non-EU buyer)"
    weight: 5
    flow:
      - post:
          url: "/api/v1/demo/compliance-check"
          json:
            walletAddress: "0x{{ $randomString(40) }}"
            vertical: "solar"
            geoCountry: "{{ $randomItem(['DE', 'FR', 'NL', 'ES', 'IT']) }}"
            geoState: "{{ $randomItem(['NW', 'BY', 'IDF', 'PRV', 'NH', 'CAT', 'LOM']) }}"
            buyerCountry: "{{ $randomItem(['US', 'CA', 'JP', 'AU']) }}"
            checkType: "cross_border_ace"
          expect:
            - statusCode:
                - 200
                - 403

  # ─── EU solar geo-match batch (3% traffic) ─────
  - name: "EU solar geo-match (50 leads)"
    weight: 3
    flow:
      - get:
          url: "/api/v1/asks?country={{ $randomItem(['DE', 'FR', 'NL']) }}&vertical=solar&limit=50"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200
      - post:
          url: "/api/v1/demo/compliance-check"
          json:
            walletAddress: "0x{{ $randomString(40) }}"
            vertical: "solar"
            geoCountry: "{{ $randomItem(['DE', 'FR']) }}"
            geoState: "{{ $randomItem(['NW', 'BY', 'IDF']) }}"
          expect:
            - statusCode: 200

  # ─── Off-site fraud toggle (2% traffic) ────────
  - name: "Off-site fraud — bid on no-offsite ask"
    weight: 2
    flow:
      - post:
          url: "/api/v1/bids"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          json:
            leadId: "{{ $randomString() }}"
            amount: "{{ $randomNumber(20, 150) }}"
            source: "OFFSITE"
            geoState: "{{ $randomItem(['CA', 'TX', 'FL']) }}"
          expect:
            - statusCode:
                - 201
                - 400
                - 403
                - 404

  # ─── Bid burst spike (2% traffic) ──────────────
  - name: "Bid burst — 1000+ rapid bids on single lead"
    weight: 2
    flow:
      - loop:
          - post:
              url: "/api/v1/bids"
              headers:
                Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
              json:
                leadId: "spike-lead-001"
                amount: "{{ $randomNumber(10, 500) }}"
                geoState: "{{ $randomItem(['CA', 'TX', 'FL', 'NY']) }}"
              expect:
                - statusCode:
                    - 201
                    - 400
                    - 403
                    - 404
                    - 429
          count: 10

  # ─── Vertical suggest (5% traffic) ──────────
  - name: "Suggest vertical (AI)"
    weight: 5
    flow:
      - post:
          url: "/api/v1/verticals/suggest"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          json:
            description: "{{ $randomItem(['Need roofing repair for storm damage', 'Looking for solar panel installation for commercial building', 'Emergency plumbing leak in basement', 'Personal injury attorney after car accident', 'CRM software for mid-market B2B company']) }}"
            vertical: "{{ $randomItem(['solar', 'roofing', 'insurance', 'legal', 'b2b_saas']) }}"
          expect:
            - statusCode:
                - 200
                - 201
                - 400

  # ─── Activate vertical (2% traffic) ─────────
  - name: "Activate vertical NFT"
    weight: 2
    flow:
      - put:
          url: "/api/v1/verticals/{{ $randomItem(['solar.residential', 'roofing.repair', 'insurance.auto', 'legal.personal_injury']) }}/activate"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          json:
            recipientAddress: "0x{{ $randomString(40) }}"
          expect:
            - statusCode:
                - 200
                - 400
                - 404
                - 409

  # ─── Get vertical hierarchy (3% traffic) ────
  - name: "Get vertical hierarchy"
    weight: 3
    flow:
      - get:
          url: "/api/v1/verticals/hierarchy"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode: 200

  # ─── Get vertical by slug (2% traffic) ──────
  - name: "Get vertical by slug"
    weight: 2
    flow:
      - get:
          url: "/api/v1/verticals/{{ $randomItem(['solar', 'mortgage', 'roofing.repair', 'insurance.auto', 'legal.personal_injury', 'b2b_saas.crm']) }}"
          headers:
            Authorization: "Bearer {{ $processEnvironment.TEST_TOKEN }}"
          expect:
            - statusCode:
                - 200
                - 404